In [ ]:
!mkdir -p ~/.aws
!pip install -qq psycopg2-binary awscli boto3 awswrangler s3fs

In [ ]:
%%writefile ~/.aws/credentials
[default]
aws_access_key_id=
aws_secret_access_key=

In [ ]:
%%writefile ~/.aws/config
[default]
region=us-east-1
output=json

In [1]:
import boto3
import json

%reload_ext sql

In [2]:
def get_secret(secret_name):
    region_name = "us-east-1"
    session = boto3.session.Session()
    client = session.client(
        service_name='secretsmanager',
        region_name=region_name)
    get_secret_value_response = client.get_secret_value(SecretId=secret_name)
    get_secret_value_response = json.loads(get_secret_value_response['SecretString'])
    return get_secret_value_response

db_credentials = get_secret(secret_name='wysde')

USERNAME = db_credentials["REDSHIFT_USERNAME"]
PASSWORD = db_credentials["REDSHIFT_PASSWORD"]
HOST = db_credentials["REDSHIFT_HOST"]
PORT = db_credentials["REDSHIFT_PORT"]
DBNAME = "dev"
CONN = f"postgresql://{USERNAME}:{PASSWORD}@{HOST}:{PORT}/{DBNAME}"

%sql {CONN}

'Connected: admin@dev'

In [ ]:
SCHEMA = "retail"
%sql CREATE SCHEMA IF NOT EXISTS {SCHEMA}
%sql SET search_path = {SCHEMA}

## Copy Data from s3 into Redshift Tables

### Create Database and Table for Redshift

In [ ]:
%%sql
DROP TABLE IF EXISTS orders;
CREATE TABLE orders (
  order_id INT PRIMARY KEY,
  order_date DATETIME,
  order_customer_id INT,
  order_status VARCHAR(30)
);

### Troubleshoot Errors related to Redshift Copy Command

In [ ]:
%sql SELECT * FROM sys_load_error_detail LIMIT 10;

### Run Copy Command to copy from s3 to Redshift table

In [41]:
REDSHIFT_IAM_ROLE = 'arn:aws:iam::684199068947:role/service-role/AmazonRedshift-CommandsAccessRole-20220921T223853'

In [ ]:
%sql COPY orders FROM 's3://wysde2/retail_db/orders/part_0000.csv' iam_role '{REDSHIFT_IAM_ROLE}' DATEFORMAT 'auto' CSV;

### Validate using queries against Redshift Table

In [65]:
%sql SELECT * FROM orders LIMIT 10;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
10 rows affected.

[(14, datetime.datetime(2013, 7, 25, 0, 0), 9842, 'PROCESSING'),
 (130, datetime.datetime(2013, 7, 26, 0, 0), 7509, 'PENDING_PAYMENT'),
 (257, datetime.datetime(2013, 7, 26, 0, 0), 3273, 'PROCESSING'),
 (571, datetime.datetime(2013, 7, 28, 0, 0), 5006, 'PENDING'),
 (572, datetime.datetime(2013, 7, 28, 0, 0), 6691, 'PENDING'),
 (644, datetime.datetime(2013, 7, 28, 0, 0), 7295, 'PENDING_PAYMENT'),
 (773, datetime.datetime(2013, 7, 29, 0, 0), 10414, 'PENDING_PAYMENT'),
 (789, datetime.datetime(2013, 7, 29, 0, 0), 17, 'COMPLETE'),
 (900, datetime.datetime(2013, 7, 30, 0, 0), 8585, 'CLOSED'),
 (950, datetime.datetime(2013, 7, 30, 0, 0), 4151, 'PENDING_PAYMENT')]

In [66]:
%sql SELECT count(1) FROM orders;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
1 rows affected.

[(68883,)]

### Copy JSON Data from s3 to Redshift table using IAM Role

In [ ]:
%%sql
DROP TABLE IF EXISTS order_items;

CREATE TABLE order_items (
  order_item_id INT PRIMARY KEY,
  order_item_order_id INT,
  order_item_product_id INT,
  order_item_quantity INT,
  order_item_subtotal FLOAT,
  order_item_product_price FLOAT
);

In [ ]:
%sql COPY order_items FROM 's3://wysde2/retail_db/retail_db_json/order_items' iam_role '{REDSHIFT_IAM_ROLE}' JSON AS 'auto';

In [71]:
%sql SELECT * FROM order_items LIMIT 10;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
10 rows affected.

[(1, 1, 957, 1, 299.98, 299.98),
 (61, 20, 1014, 4, 199.92, 49.98),
 (148, 61, 191, 4, 399.96, 99.99),
 (434, 180, 403, 1, 129.99, 129.99),
 (504, 207, 191, 1, 99.99, 99.99),
 (522, 214, 191, 2, 199.98, 99.99),
 (590, 239, 627, 2, 79.98, 39.99),
 (752, 300, 116, 1, 44.99, 44.99),
 (877, 353, 365, 3, 179.97, 59.99),
 (946, 381, 810, 5, 99.95, 19.99)]

In [73]:
%sql SELECT count(*) FROM order_items;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
1 rows affected.

[(172198,)]

## Basic SQL Queries using AWS Redshift SQL

### Filtering Data using AWS Redshift

In [74]:
%%sql
SELECT *
FROM orders
WHERE order_status = 'COMPLETE'
LIMIT 10;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
10 rows affected.

[(248, datetime.datetime(2013, 7, 26, 0, 0), 11707, 'COMPLETE'),
 (516, datetime.datetime(2013, 7, 28, 0, 0), 9204, 'COMPLETE'),
 (659, datetime.datetime(2013, 7, 28, 0, 0), 6006, 'COMPLETE'),
 (736, datetime.datetime(2013, 7, 29, 0, 0), 8536, 'COMPLETE'),
 (770, datetime.datetime(2013, 7, 29, 0, 0), 12146, 'COMPLETE'),
 (1321, datetime.datetime(2013, 8, 1, 0, 0), 800, 'COMPLETE'),
 (1452, datetime.datetime(2013, 8, 1, 0, 0), 4953, 'COMPLETE'),
 (1599, datetime.datetime(2013, 8, 2, 0, 0), 8647, 'COMPLETE'),
 (1822, datetime.datetime(2013, 8, 3, 0, 0), 5682, 'COMPLETE'),
 (58075, datetime.datetime(2013, 8, 6, 0, 0), 1136, 'COMPLETE')]

In [75]:
%%sql
SELECT *
FROM orders
WHERE order_status = 'COMPLETE' 
	AND order_date = '2014-01-01 00:00:00.0'
LIMIT 10;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
10 rows affected.

[(25882, datetime.datetime(2014, 1, 1, 0, 0), 4598, 'COMPLETE'),
 (25895, datetime.datetime(2014, 1, 1, 0, 0), 1044, 'COMPLETE'),
 (25888, datetime.datetime(2014, 1, 1, 0, 0), 6735, 'COMPLETE'),
 (25901, datetime.datetime(2014, 1, 1, 0, 0), 3099, 'COMPLETE'),
 (25920, datetime.datetime(2014, 1, 1, 0, 0), 12232, 'COMPLETE'),
 (25921, datetime.datetime(2014, 1, 1, 0, 0), 12373, 'COMPLETE'),
 (25936, datetime.datetime(2014, 1, 1, 0, 0), 3057, 'COMPLETE'),
 (25962, datetime.datetime(2014, 1, 1, 0, 0), 5170, 'COMPLETE'),
 (25980, datetime.datetime(2014, 1, 1, 0, 0), 363, 'COMPLETE'),
 (25924, datetime.datetime(2014, 1, 1, 0, 0), 3826, 'COMPLETE')]

In [76]:
%%sql
SELECT *
FROM orders
WHERE order_status = 'COMPLETE' 
	AND order_date LIKE '2014-01%'
LIMIT 10;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
10 rows affected.

[(26032, datetime.datetime(2014, 1, 2, 0, 0), 2424, 'COMPLETE'),
 (26596, datetime.datetime(2014, 1, 5, 0, 0), 6998, 'COMPLETE'),
 (62102, datetime.datetime(2014, 1, 9, 0, 0), 6176, 'COMPLETE'),
 (27823, datetime.datetime(2014, 1, 13, 0, 0), 3017, 'COMPLETE'),
 (28732, datetime.datetime(2014, 1, 18, 0, 0), 5654, 'COMPLETE'),
 (28915, datetime.datetime(2014, 1, 19, 0, 0), 166, 'COMPLETE'),
 (29147, datetime.datetime(2014, 1, 21, 0, 0), 6118, 'COMPLETE'),
 (29649, datetime.datetime(2014, 1, 24, 0, 0), 8244, 'COMPLETE'),
 (29858, datetime.datetime(2014, 1, 26, 0, 0), 5670, 'COMPLETE'),
 (30194, datetime.datetime(2014, 1, 28, 0, 0), 9135, 'COMPLETE')]

In [77]:
%%sql
SELECT *
FROM orders
WHERE order_status IN ('COMPLETE', 'CLOSED')
LIMIT 10;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
10 rows affected.

[(80, datetime.datetime(2013, 7, 25, 0, 0), 3007, 'COMPLETE'),
 (771, datetime.datetime(2013, 7, 29, 0, 0), 9026, 'COMPLETE'),
 (782, datetime.datetime(2013, 7, 29, 0, 0), 12213, 'COMPLETE'),
 (972, datetime.datetime(2013, 7, 30, 0, 0), 10255, 'CLOSED'),
 (58029, datetime.datetime(2013, 8, 4, 0, 0), 2863, 'COMPLETE'),
 (2950, datetime.datetime(2013, 8, 10, 0, 0), 3757, 'COMPLETE'),
 (3343, datetime.datetime(2013, 8, 12, 0, 0), 12289, 'CLOSED'),
 (3401, datetime.datetime(2013, 8, 13, 0, 0), 3038, 'COMPLETE'),
 (58244, datetime.datetime(2013, 8, 13, 0, 0), 2316, 'CLOSED'),
 (3477, datetime.datetime(2013, 8, 14, 0, 0), 6898, 'COMPLETE')]

In [78]:
%%sql
SELECT *
FROM orders
WHERE order_status IN ('COMPLETE', 'CLOSED')
	AND order_date LIKE '2014-01%'
LIMIT 10;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
10 rows affected.

[(25990, datetime.datetime(2014, 1, 2, 0, 0), 4870, 'CLOSED'),
 (26357, datetime.datetime(2014, 1, 4, 0, 0), 11733, 'COMPLETE'),
 (26460, datetime.datetime(2014, 1, 5, 0, 0), 7582, 'COMPLETE'),
 (26995, datetime.datetime(2014, 1, 9, 0, 0), 7456, 'COMPLETE'),
 (27066, datetime.datetime(2014, 1, 9, 0, 0), 2994, 'CLOSED'),
 (27188, datetime.datetime(2014, 1, 10, 0, 0), 12389, 'COMPLETE'),
 (27464, datetime.datetime(2014, 1, 11, 0, 0), 7274, 'COMPLETE'),
 (27911, datetime.datetime(2014, 1, 13, 0, 0), 8571, 'COMPLETE'),
 (27949, datetime.datetime(2014, 1, 14, 0, 0), 11080, 'CLOSED'),
 (68784, datetime.datetime(2014, 1, 14, 0, 0), 10349, 'COMPLETE')]

### Total Aggregations using AWS Redshift SQL

In [79]:
%%sql
WITH
    sales AS (
        SELECT 1 AS sale_id, 1 AS course_id, 10.99 AS sale_amount
        UNION ALL
        SELECT 2, 2, 9.99
        UNION ALL
        SELECT 3, 1, 10.99
        UNION ALL
        SELECT 4, 3, 12.99
        UNION ALL
        SELECT 5, 3, 12.99
        UNION ALL
        SELECT 6, 1, 9.99
        UNION ALL
        SELECT 7, 2, 10.99
        UNION ALL
        SELECT 8, 2, 9.99
        UNION ALL
        SELECT 9, 4, 11.99
        UNION ALL
        SELECT 10, 1, 13.99
    )
SELECT * FROM sales;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
10 rows affected.

[(1, 1, Decimal('10.99')),
 (2, 2, Decimal('9.99')),
 (3, 1, Decimal('10.99')),
 (4, 3, Decimal('12.99')),
 (5, 3, Decimal('12.99')),
 (6, 1, Decimal('9.99')),
 (7, 2, Decimal('10.99')),
 (8, 2, Decimal('9.99')),
 (9, 4, Decimal('11.99')),
 (10, 1, Decimal('13.99'))]

In [80]:
%%sql
SELECT count(distinct order_date),
	count(distinct order_status)
FROM orders;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
1 rows affected.

[(364, 9)]

In [81]:
%%sql
SELECT * 
FROM order_items 
LIMIT 10;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
10 rows affected.

[(1, 1, 957, 1, 299.98, 299.98),
 (61, 20, 1014, 4, 199.92, 49.98),
 (148, 61, 191, 4, 399.96, 99.99),
 (434, 180, 403, 1, 129.99, 129.99),
 (504, 207, 191, 1, 99.99, 99.99),
 (522, 214, 191, 2, 199.98, 99.99),
 (590, 239, 627, 2, 79.98, 39.99),
 (752, 300, 116, 1, 44.99, 44.99),
 (877, 353, 365, 3, 179.97, 59.99),
 (946, 381, 810, 5, 99.95, 19.99)]

In [82]:
%%sql
SELECT round(sum(order_item_subtotal), 2)
FROM order_items
WHERE order_item_order_id = 2;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
1 rows affected.

[(579.98,)]

In [83]:
%%sql
SELECT count(*) item_count,
	round(sum(order_item_subtotal), 2) total_revenue,
    round(avg(order_item_subtotal), 2) avg_revenue
FROM order_items
WHERE order_item_order_id = 2;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
1 rows affected.

[(3, 579.98, 193.33)]

### Overview of With Clause in Redshift SQL

In [84]:
%%sql
WITH 
    product_dim AS (
        SELECT p.*,
            c.category_name,
            c.category_department_id,
            d.department_name
        FROM products AS p
            JOIN categories AS c
                ON p.product_category_id = c.category_id
            JOIN departments AS d
                ON c.category_department_id = d.department_id
    )
SELECT count(*) FROM product_dim;

 * postgresql://admin:***@default.684199068947.us-east-1.redshift-serverless.amazonaws.com:5439/dev
(psycopg2.errors.UndefinedTable) relation "products" does not exist

[SQL: WITH
    product_dim AS (
        SELECT p.*,
            c.category_name,
            c.category_department_id,
            d.department_name
        FROM products AS p
            JOIN categories AS c
                ON p.product_category_id = c.category_id
            JOIN departments AS d
                ON c.category_department_id = d.department_id
    )
SELECT count(*) FROM product_dim;]
(Background on this error at: https://sqlalche.me/e/14/f405)